export const news = [
    {
      name: 'Открытие «Мамского дома» в Минске. Под брендом «Мамский дом» одновременно работает офис общего типа, свободное творческое постранство и...',
      image: 'https://avatars.mds.yandex.net/get-zen_doc/1587012/pub_5d9b30daecfb8000b1fc28c4_5d9b30f735c8d800ae71f929/scale_1200',
    },
    {
      name: 'В Иркутске открылся центр молодежи и коворкинг. Эти пространства нацелены на развитие общественного движения, которое получило название «Наш Иркутск...',
      image: 'https://irk.today/wp-content/uploads/2020/03/vbmnyf6wqzm.jpg',
    },
    {
      name: 'Открытие в МАИ экспозиции и коворкинг-центра. В МАИ 16 марта произошло открытие экспозиции, посвященной военной орбитальной станции под названием...',
      image: 'https://sokol.mos.ru/1-_8-of-14_.jpg',
    },
    {
      name: 'На месте TrendBar в Новосибирске был открыт коворкинг. Произошло это, благодаря усилиям Григория Крашенинникова в паре с Антоном Горестовым. Новое заведени...',
      image: 'https://biz-on.biz/wp-content/uploads/2019/12/22-25.jpg',
    },
    {
      name: 'На Красном Проспекте стал действовать коворкинг. В Новосибирске – там, где ранее располагался пивной бар, стал действовать рабочий офис современного...',
      image: 'http://voms.ru/upload/iblock/52d/52d5338176fc603e8f58c5f48f34f577.jpg',
    },
    {
      name: 'Коронавирус может привести к массовому наплыву посетителей в столичные smart-офисы. Коронавирус распространился по нескольким регионом России, но более 80% больных сконцентрировано име...',
      image: 'https://businessman.ru/static/img/n/1/3/3/5/6/4/7/i/1335647.jpg',
    },
]