# Максимум из двух чисел
# Входные данные
# Даны два целых числа, каждое число записано в отдельной строке.
#
# Выходные данные
# Выведите наибольшее из данных чисел.
#
# Примеры
# входные данные
# 1
# 2
# выходные данные
# 2

a = int(input())
b = int(input())
print(max(a,b))