# Делители числа
# Выведите все натуральные делители числа x в порядке возрастания (включая 1 и само число).
#
# Входные данные
# Вводится натуральное число x
#
# Выходные данные
# Выведите все делители числа x
#
# Примеры
# входные данные
# 32
# выходные данные
# 1 2 4 8 16 32

x=int(input())
for i in range (1, x+1):
    if(x%i==0):
        print(i)

